class ºØ¾î»§Æ² //Å¬·¡½º
{
	String ¾Ó²¿ ; //¸â¹ö (¼Ó¼º)
	int °¡°Ý; //¸â¹ö

	ºØ¾î»§Æ²(){
		¾Ó²¿ = "ÆÏ";
		°¡°Ý = 500;
	}
	ºØ¾î»§Æ²(String ¾Ó²¿, int °¡°Ý){
		this.¾Ó²¿ = ¾Ó²¿;
		this.°¡°Ý = °¡°Ý;
	}
	void ¹èºÎ¸£°ÔÇÑ´Ù (){ //¸Þ¼Òµå
		System.out.println("¹èºÎ¸£°ÔÇÑ´Ù");
	}
	void µû½ºÇÏ°ÔÇÑ´Ù (){ //¸Þ¼Òµå
		System.out.println("µû½ºÇÏ°ÔÇÑ´Ù");
	}
}

class D 
{
	public static void main(String[] args) 
	{
		ºØ¾î»§Æ² ºØ¾î»§1 = new ºØ¾î»§Æ²(); //°´Ã¼
		System.out.println("¾Ó²¿°¡ " + ºØ¾î»§1.¾Ó²¿ + "ÀÌ°í °¡°ÝÀÌ " + ºØ¾î»§1.°¡°Ý + "¿øÀÎ ºØ¾î»§ÀÌ ");
		ºØ¾î»§1.¹èºÎ¸£°ÔÇÑ´Ù();

		ºØ¾î»§Æ² ºØ¾î»§2 = new ºØ¾î»§Æ²("½´Å©¸²", 700);
		System.out.println("¾Ó²¿°¡ " + ºØ¾î»§2.¾Ó²¿ + "ÀÌ°í °¡°ÝÀÌ " + ºØ¾î»§2.°¡°Ý + "¿øÀÎ ºØ¾î»§ÀÌ ");
		ºØ¾î»§2.µû½ºÇÏ°ÔÇÑ´Ù();

	}
}
